app/Controllers/JournalController.php

    private function genrateHashPwd() {
        $userss = new UserModel();
        $fetchuserss = $userss->asObject()->findAll();
---
SELECT *
FROM `tbl_users`
WHERE `tbl_users`.`deleted_at` IS NULL

        public function journal_view()
        {

            $user_id = 0;
            if (session()->has('user_id')) {
                $user_id = session()->get('user_id');
            }
            $this->session->set('active', '2');
            $this->session->set('sub', '4');
            $journalModel = new JournalModel();
            $journal_data = $journalModel->where('user_id',$user_id)->first();
---
SELECT *
FROM `tbl_journal`
WHERE `user_id` = '18'
 LIMIT 1