app/Controllers/WebAppController.php

    private function upload_file_history($data)
    {
        $allFiles = new AllFiles();
        extract($data);
        if ($file_upload && $file_upload->isValid()) {
            $file_directory .= '/';
            $file_upload->move(WRITEPATH . 'uploads/' . $file_directory, $newfilename);
            $remv = [
                "newfilename" => "remove/",
                "file_upload" => "remove/"
            ];
            $data = \array_diff_key($data, $remv);
            $data['file_upload'] = $newfilename;

            $allFiles->save($data);
---
INSERT INTO `tbl_all_files` (`file_directory`, `file_page_name`, `page_id`, `file_upload`, `created_at`, `updated_at`, `user_id`) VALUES ('PR2-5 - Ingredient Batches', 'Ingredient Batches', 8, 'IBN-1-2024-08-15.pdf', '2024-08-11 19:07:26', '2024-08-11 19:07:26', '18')

            public function edit_formula($formula_id)
            {
                $allformula = new FormulaModel();
                $formula = $allformula->where("formula_id", $formula_id)->first();
---
SELECT *
FROM `tbl_formula`
WHERE `formula_id` = '18'
AND `tbl_formula`.`deleted_at` IS NULL
 LIMIT 1

            public function upd_formula($data, $formula_id): void
            {

                $updateformula = new FormulaModel();
                $builder = $updateformula->builder();
                $builder->where("formula_id", $formula_id);
                $builder->update($data);
---
UPDATE `tbl_formula` SET `formula_id` = '18', `formula_date` = '2024-08-31', `formula_rdplan` = 'Test 11', `formula_version` = 'With Zero - New One', `formula_comments` = 'This formula did not work as expected. The ratio needed to be changed. This was a copy of another formula, so we did not expect to the outcome to be the same as what it was.', `formula_status` = 'New'
WHERE `formula_id` = '18'

    public function rd_formula_ingredients_data($formula_id)
    {

        $allf_ingredients = new Formula_IngredientsModel();
        $data['f_ingredients'] = $allf_ingredients->f_ingredientsWith($formula_id);
        // dd($formula_id);
        $findFIng = $allf_ingredients->find();
---
SELECT *
FROM `tbl_formula_ingredients`
WHERE `tbl_formula_ingredients`.`deleted_at` IS NULL

    public function manuf_production_batch_data($manuf_product_id)
    {

        $allbatch = new Manuf_ProductionBatchModel();
        $allIngBatch = new IngredientBatchModel();

        $manuf_batch = [];
        $manuf_batchs = $allbatch->productionbatchWith($manuf_product_id);

        if ($manuf_batchs != null) {
            foreach ($manuf_batchs as $batch) {
                $batch = (array) $batch;
                $ba = $allbatch->where([
                    'manuf_production_batch_production' => $batch['manuf_product_id'],
                    'manuf_production_batch_ingredients' => $batch['ingredient_id'],
                    'manuf_production_batch_id' => $batch['manuf_production_batch'],
                    'f_ingredients_id' => $batch['f_ingredients_id'],
                    'user_id' => $this->user_id
                ])->first();
---
SELECT *
FROM `tbl_manuf_production_batch`
WHERE `manuf_production_batch_production` = '8'
AND `manuf_production_batch_ingredients` = '1'
AND `user_id` = '18'
AND `tbl_manuf_production_batch`.`deleted_at` IS NULL
 LIMIT 1

    public function rd_cpn()
    {

        $this->session->set('active', '3');
        $this->session->set('sub', '1');

        $allusers = new UserModel();
        $data['users'] = $allusers->where(['user_id' => $this->user_id])->findAll();
---
SELECT *
FROM `tbl_users`
WHERE `user_id` = '18'
AND `tbl_users`.`deleted_at` IS NULL

    public function checkQty($def = 0)
    {
        $item_id = $this->request->getPost('item_id');
        $item_name = $this->request->getPost('item_name');
        $item_qty = $this->request->getPost('item_qty');
        $total = 0;
        if ($item_name == 'ingredient') {
            $ingred = new IngredientModel();
            $meanQty = $ingred->find($item_id);
---
SELECT *
FROM `tbl_ingredients`
WHERE `tbl_ingredients`.`deleted_at` IS NULL
AND `tbl_ingredients`.`ingredient_id` = '1'

    public function planning()
    {

        $this->session->set('active', '4');
        $this->session->set('sub', '2');

        $allbudgets = new ModelsModel();
        $data['models'] = $allbudgets->where(['user_id' => $this->user_id])->findAll();
---
SELECT *
FROM `tbl_models`
WHERE `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL

    public function models_overheads_data($models_id)
    {
        $allmodels = new ModelsModel();
        $data["models"] = $allmodels->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '2'
AND `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    public function models_ingredients_api($models_id)
    {
        $allmodels = new ModelsModel();

        $allmodeloverheads = new OverheadsModel();
        $data['ingredients'] = $allmodeloverheads->where(['user_id' => $this->user_id])->findAll();
        $f_ingredients = [];
        $data['batch_qty'] = 0;
        $data['unit_qty'] = 0;
        $data['formula_counts'] = 0;
        $rd_formula = new FormulaModel();

        // corporate models ingredient
        $corpIngredients = new CorpIngredientsModel();
        $data['corpIngredients'] = $corpIngredients->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '2'
AND `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    public function models_ingredients($models_id)
    {
        $allmodels = new ModelsModel();
        $data = $this->models_ingredients_api($models_id);
        $data["models"] = $allmodels->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '2'
AND `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    public function models_ingredients_data($models_id)
    {
        $allmodels = new ModelsModel();
        $data = $this->models_ingredients_api($models_id);
        $data["models"] = $allmodels->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '2'
AND `user_id` = '22'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    public function models_manufacturing($models_id)
    {
        // $data = $this->models_manufacturing_api($models_id);
        // dd($data);
        $allmodels = new ModelsModel();
        $data["models"] = $allmodels->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '1'
AND `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    private function get_models_marketing($models_id)
    {
        $allmodels = new ModelsModel();
        $data["models"] = $allmodels->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
        if (empty($data["models"])) {
            return null;
        }
        $data['models_oht'] = 0;
        $markt_models = new CorpMarketingModel();
        $data["marketing"] = $markt_models->where(["models_id" => $models_id, 'user_id' => $this->user_id])->first();
---
SELECT *
FROM `tbl_models`
WHERE `models_id` = '1'
AND `user_id` = '18'
AND `tbl_models`.`deleted_at` IS NULL
 LIMIT 1

    private function genrateHashPwd()
    {
        $userss = new UserModel();
        $fetchuserss = $userss->asObject()->findAll();
---
SELECT *
FROM `tbl_users`
WHERE `tbl_users`.`deleted_at` IS NULL