app/Models/Manuf_ProductionBatchModel.php

    public function productionbatchWith($manuf_product_id){
        $db = db_connect();
        $builder = $db  ->table('tbl_manuf_production t1')
                        ->join('tbl_formula t2', 't2.formula_id = t1.manuf_product_formula')
                        ->join('tbl_users t6', 't6.user_id = t1.user_id')
                        ->join('tbl_formula_ingredients t3', 't3.f_ingredients_formula = t2.formula_id')
                        ->join('tbl_ingredients t4', 't4.ingredient_id = t3.f_ingredients_ingredients')
                        ->where('t1.user_id', $_SESSION['user_id'])
                        ->where('t6.user_id', $_SESSION['user_id'])
                        ->where('t4.user_id', $_SESSION['user_id'])
                        ->where('t1.manuf_product_id ', $manuf_product_id)
                        ->where('t1.deleted_at IS NULL')
                        ->where('t2.deleted_at IS NULL')
                        ->where('t3.deleted_at IS NULL')
                        ->where('t4.deleted_at IS NULL');
        $query = $builder->get();
---
SELECT *
FROM `tbl_manuf_production` `t1`
JOIN `tbl_formula` `t2` ON `t2`.`formula_id`  = `t1`.`manuf_product_formula`
JOIN `tbl_users` `t6` ON `t6`.`user_id`  = `t1`.`user_id`
JOIN `tbl_formula_ingredients` `t3` ON `t3`.`f_ingredients_formula`  = `t2`.`formula_id`
JOIN `tbl_ingredients` `t4` ON `t4`.`ingredient_id`  = `t3`.`f_ingredients_ingredients`
WHERE `t1`.`deleted_at` IS NULL
AND `t1`.`user_id` = '18'
AND `t6`.`user_id` = '18'
AND `t4`.`user_id` = '18'
AND `t1`.`manuf_product_id` = '5'
AND `t3`.`deleted_at` IS NULL