app/Models/Manuf_ProductionModel.php

SELECT *
FROM `tbl_manuf_production` `t1`
JOIN `tbl_formula` `t2` ON `t2`.`formula_id` = `t1`.`manuf_product_formula`
JOIN `tbl_users` `t4` ON `t4`.`user_id` = `t1`.`user_id`
WHERE `t1`.`user_id` = '18'
AND `t2`.`user_id` = '18'
AND `t4`.`user_id` = '18'
AND `t1`.`deleted_at` IS NULL
---
    public function manufproductWith(){
            $db = db_connect();
            $builder = $db  ->table('tbl_manuf_production t1')
                            ->join('tbl_formula t2', 't2.formula_id = t1.manuf_product_formula',)
                            ->join('tbl_users t4', 't4.user_id = t1.user_id')
                            ->where('t1.user_id', $_SESSION['user_id'])
                            ->where('t2.user_id', $_SESSION['user_id'])
                            ->where('t4.user_id', $_SESSION['user_id'])
                            ->where('t1.deleted_at IS NULL');
        $query = $builder->get();